## Pandas Dataframes

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(data=[12, 21, 32])
df

    0
0  12
1  21
2  32

In [4]:
s = pd.Series(data=[12, 21, 32])
s

0    12
1    21
2    32
dtype: int64

In [5]:
df = pd.DataFrame(data=[12, 21, 32], index=['first', 'second', 'third'], columns=['col_1'])
df

        col_1
first      12
second     21
third      32

In [6]:
df = pd.DataFrame(data={'WIG20': ['PKN ORLEN', 'PKO BP'], 'mWIG40': ['Amica','Playway']})
df

       WIG20   mWIG40
0  PKN ORLEN    Amica
1     PKO BP  Playway

In [7]:
df = pd.DataFrame(data=[[10, 12, 13], [23, 12, 10]], index=['First','Second'], 
                  columns=['col_1', 'col_2', 'col3'])
df

        col_1  col_2  col3
First      10     12    13
Second     23     12    10

In [8]:
df.columns

Index(['col_1', 'col_2', 'col3'], dtype='object')

In [9]:
df.index

Index(['First', 'Second'], dtype='object')

In [10]:
df.values

array([[10, 12, 13],
       [23, 12, 10]], dtype=int64)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, First to Second
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_1   2 non-null      int64
 1   col_2   2 non-null      int64
 2   col3    2 non-null      int64
dtypes: int64(3)
memory usage: 144.0+ bytes

In [12]:
df.describe()

           col_1  col_2      col3
count   2.000000    2.0   2.00000
mean   16.500000   12.0  11.50000
std     9.192388    0.0   2.12132
min    10.000000   12.0  10.00000
25%    13.250000   12.0  10.75000
50%    16.500000   12.0  11.50000
75%    19.750000   12.0  12.25000
max    23.000000   12.0  13.00000

In [13]:
df.describe().T

       count  mean       std   min    25%   50%    75%   max
col_1    2.0  16.5  9.192388  10.0  13.25  16.5  19.75  23.0
col_2    2.0  12.0  0.000000  12.0  12.00  12.0  12.00  12.0
col3     2.0  11.5  2.121320  10.0  10.75  11.5  12.25  13.0

In [14]:
df['col_1']

First     10
Second    23
Name: col_1, dtype: int64

In [15]:
type(df['col_1'])

pandas.core.series.Series

In [16]:
df[['col_1']]

        col_1
First      10
Second     23

In [17]:
type(df[['col_1']])

pandas.core.frame.DataFrame

In [20]:
df.columns = ['a', 'b', 'c']
df

         a   b   c
First   10  12  13
Second  23  12  10

In [21]:
df.a

First     10
Second    23
Name: a, dtype: int64

In [23]:
df['d'] = df.a + df.c
df

         a   b   c   d
First   10  12  13  23
Second  23  12  10  33

In [24]:
df = pd.DataFrame(data=[[10, 12, 13], [23, 12, 10]], index=['First','Second'], 
                  columns=['col_1', 'col_2', 'col3'])
df

        col_1  col_2  col3
First      10     12    13
Second     23     12    10

In [26]:
df.loc['First']

col_1    10
col_2    12
col3     13
Name: First, dtype: int64

In [29]:
df.loc['Second','col_2']

12

In [33]:
df.loc[:,'col_2']

First     12
Second    12
Name: col_2, dtype: int64

In [27]:
df.iloc[0]

col_1    10
col_2    12
col3     13
Name: First, dtype: int64

In [34]:
df.iloc[0,1]

12

In [35]:
df.iloc[:,1]

First     12
Second    12
Name: col_2, dtype: int64